In [1]:
## Merge


## Pandas provides various facilities for easily combining Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

## Concatenating Pandas objects together with concat() (equivalent to UNION in SQL):

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randn(10, 4))

In [5]:
df

          0         1         2         3
0 -0.410229  1.136943 -1.609605  1.177496
1  0.599490  0.545024  0.981567 -0.264657
2  0.605356  1.050156 -0.980916 -0.021548
3 -1.195792 -0.177803 -2.125146 -1.400833
4 -1.297236  0.936568  0.842913 -0.720536
5  0.079628 -0.729410 -0.085288  0.700006
6 -1.550092 -1.784123  1.018998  1.280140
7 -1.059806  0.408131  0.792996  0.214030
8  0.624067  0.481986 -0.260608  0.656006
9  0.346917 -1.546144 -0.259574 -1.150447

In [6]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [7]:
pd.concat(pieces)

          0         1         2         3
0 -0.410229  1.136943 -1.609605  1.177496
1  0.599490  0.545024  0.981567 -0.264657
2  0.605356  1.050156 -0.980916 -0.021548
3 -1.195792 -0.177803 -2.125146 -1.400833
4 -1.297236  0.936568  0.842913 -0.720536
5  0.079628 -0.729410 -0.085288  0.700006
6 -1.550092 -1.784123  1.018998  1.280140
7 -1.059806  0.408131  0.792996  0.214030
8  0.624067  0.481986 -0.260608  0.656006
9  0.346917 -1.546144 -0.259574 -1.150447

In [8]:
## To join two data-frames, we use merge() in Pandas (equivalent to JOIN in SQL).

In [9]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [10]:
## Make an inner join between tables created above on column key:

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [11]:
## Inner join is done automatically with merge(). If you want to do other types of joins like the outer, left or right, you should use the parameter, how.

pd.merge(left, right, on='key', how='outer')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [12]:
### Grouping


## By group by, we are referring to a process involving the following steps:

# - Splitting the data into groups based on some criteria
# - Applying a function to each group independently
# - Combining the results into a data structure


# Let's create the DataFrame we will work on.

In [13]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                        'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [14]:
## Group the DataFrame by column A and sum the values of C and D.

In [15]:
df.groupby('A').sum()

/var/folders/m7/gmztn8ls7hvb7z45rrh281mh0000gn/T/ipykernel_86956/1885751491.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').sum()

            C         D
A
bar  1.594397  0.208456
foo -1.187154 -1.752118

In [16]:
## We can also group by multiple columns. This operation will create a new DataFrame with Multilevel Index.

df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.481617 -0.215069
    three  0.848264  1.293637
    two    0.264516 -0.870112
foo one   -0.284092  0.185560
    three  0.840379 -1.001756
    two   -1.743441 -0.935922

In [18]:
## You cannot apply two aggregation functions in 1 groupby statement in Pandas. However , there is equivalent to using .agg() method

In [17]:
df.groupby('A').agg({'C': np.sum, 'D': np.max})

            C         D
A
bar  1.594397  1.293637
foo -1.187154  0.579920